src/Catalogs/ВнешниеЦКК/ВнешниеЦКК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеЦКК</name>
  <attributes>
    <name>WSСсылкаInputStatisticsDate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВнешнегоЦКК</name>
    <type>
      <types>EnumRef.ТипыВнешнихЦКК</types>
    </type>
  </attributes>
  <attributes>
    <name>УИДПользователя</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортСчетчиков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнешниеЦКК</name>
    <attributes>
      <name>ПередаватьДанные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийЦКК</name>
      <type>
        <types>CatalogRef.ВнешниеЦКК</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonForms/ФормаКонстантСтатистика/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтотОбъект.НаборКонстант.СтатистикаРазмерПакетаЗапроса = 0 Тогда
		ЭтотОбъект.НаборКонстант.СтатистикаРазмерПакетаЗапроса = 10000;
	КонецЕсли;
	
	Если ЭтотОбъект.НаборКонстант.СтатистикаРазмерПакетаЗаписи = 0 Тогда
		ЭтотОбъект.НаборКонстант.СтатистикаРазмерПакетаЗаписи = 1000;
	КонецЕсли;
	
	Если ЭтотОбъект.НаборКонстант.ПериодХраненияДанныхСтатистикаНеделя = 0 Тогда
		ЭтотОбъект.НаборКонстант.ПериодХраненияДанныхСтатистикаНеделя = 7;
	КонецЕсли;
	
	Если ЭтотОбъект.НаборКонстант.ПериодХраненияДанныхСтатистикаМесяц = 0 Тогда
		ЭтотОбъект.НаборКонстант.ПериодХраненияДанныхСтатистикаМесяц = 30;
	КонецЕсли;
	
	Если ЭтотОбъект.НаборКонстант.ПериодХраненияДанныхСтатистикаПолный = 0 Тогда
		ЭтотОбъект.НаборКонстант.ПериодХраненияДанныхСтатистикаПолный = 1000;
	КонецЕсли;
	
	//Установка параметров регзадания "СборСтатистикиВебСервисаInputStatistics"
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.СборСтатистикиВебСервисаInputStatistics);
	РегЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	ЭтотОбъект.РегЗаданиеВключено = РегЗадания[0].Использование;
	ЭтотОбъект.Расписание = РегЗадания[0].Расписание; 
	ЭтотОбъект.РегЗаданиеРасписание = Строка(ЭтотОбъект.Расписание);
	
	//Установка параметров регзадания "УдалениеПомеченныхНаУдаление"
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.УдалениеПомеченныхНаУдаление);
	РегЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	ЭтотОбъект.РегЗаданиеУдалениеВключено = РегЗадания[0].Использование;
	ЭтотОбъект.РасписаниеУдаление = РегЗадания[0].Расписание; 
	ЭтотОбъект.РегЗаданиеУдалениеРасписание = Строка(ЭтотОбъект.РасписаниеУдаление);
	
	//Установка параметров регзадания "РазборСобытийТехжурналов"
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.РазборСобытийТехжурналов);
	РегЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	
	ЭтотОбъект.РегЗаданиеТехжурналыВключено = РегЗадания[0].Использование;
	ЭтотОбъект.РасписаниеТехжурнал = РегЗадания[0].Расписание; 
	ЭтотОбъект.РегЗаданиеТехжурналРасписание = Строка(ЭтотОбъект.РасписаниеТехжурнал);
	
	ЗаполнитьНастройкиЭкспортаДанных();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиЭкспортаДанных()
	
	ВнешниеЦККМассив = Справочники.ВнешниеЦКК.ПолучитьВнешниеЦККДляОтправкиСчетчиков();
	Для Каждого ВнешнийЦКК Из ВнешниеЦККМассив Цикл
		НовСтрока = ЭтотОбъект.ВнешниеЦКК.Добавить();
		НовСтрока.ПередаватьДанные = Истина;
		НовСтрока.ВнешнийЦКК = ВнешнийЦКК;
		НовСтрока.НеобходимаЗапись = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание()
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ЭтотОбъект.Расписание);
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьРасписаниеЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеЗавершение(РасписаниеВыбрано, ДополнительныеПараметры) Экспорт
	Если РасписаниеВыбрано <> Неопределено Тогда
		ЭтотОбъект.Расписание = РасписаниеВыбрано;
		Модифицированность = Истина;
		ЭтотОбъект.РегЗаданиеРасписание = Строка(ЭтотОбъект.Расписание);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеУдаление()
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ЭтотОбъект.РасписаниеУдаление);
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьРасписаниеУдалениеЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеУдалениеЗавершение(РасписаниеВыбрано, ДополнительныеПараметры) Экспорт
	Если РасписаниеВыбрано <> Неопределено Тогда
		ЭтотОбъект.РасписаниеУдаление = РасписаниеВыбрано;
		Модифицированность = Истина;
		ЭтотОбъект.РегЗаданиеУдалениеРасписание = Строка(ЭтотОбъект.РасписаниеУдаление);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеТехжурнал()
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(ЭтотОбъект.РасписаниеТехжурнал);
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьРасписаниеТехжурналЗавершение", ЭтотОбъект);
	Диалог.Показать(ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписаниеТехжурналЗавершение(РасписаниеВыбрано, ДополнительныеПараметры) Экспорт
	Если РасписаниеВыбрано <> Неопределено Тогда
		ЭтотОбъект.РасписаниеТехжурнал = РасписаниеВыбрано;
		Модифицированность = Истина;
		ЭтотОбъект.РегЗаданиеТехжурналРасписание = Строка(ЭтотОбъект.РасписаниеТехжурнал);		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РегЗаданиеРасписаниеНажатие(Элемент, СтандартнаяОбработка)
	НастроитьРасписание();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРассписаниеНажатие(Элемент)
	НастроитьРасписание();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.СборСтатистикиВебСервисаInputStatistics);
	РегЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	РегЗадания[0].Расписание = ЭтотОбъект.Расписание;
	РегЗадания[0].Использование = ЭтотОбъект.РегЗаданиеВключено;
	РегЗадания[0].Записать();
	
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.УдалениеПомеченныхНаУдаление);
	РегЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	РегЗадания[0].Расписание = ЭтотОбъект.РасписаниеУдаление;
	РегЗадания[0].Использование = ЭтотОбъект.РегЗаданиеУдалениеВключено;
	РегЗадания[0].Записать();
	
	Отбор = Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.РазборСобытийТехжурналов);
	РегЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	РегЗадания[0].Расписание = ЭтотОбъект.РасписаниеТехжурнал;
	РегЗадания[0].Использование = ЭтотОбъект.РегЗаданиеТехжурналыВключено;
	РегЗадания[0].Записать();
	
	ЗаписатьНастройкиЭкспортаДанных();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиЭкспортаДанных()
	Для Каждого ТекДанные Из ЭтотОбъект.ВнешниеЦККУдаленные Цикл
		ВнешнийЦККОбъект = ТекДанные.ВнешнийЦКК.ПолучитьОбъект();
		ВнешнийЦККОбъект.ЭкспортСчетчиков = Ложь;
		ВнешнийЦККОбъект.Записать();
	КонецЦикла;
	
	Для Каждого ТекДанные Из ЭтотОбъект.ВнешниеЦКК Цикл
		Если ТекДанные.НеобходимаЗапись Тогда
			ВнешнийЦККОбъект = ТекДанные.ВнешнийЦКК.ПолучитьОбъект();
			ВнешнийЦККОбъект.ЭкспортСчетчиков = ТекДанные.ПередаватьДанные;
			ВнешнийЦККОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РегЗаданиеВключеноПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияРасписаниеУдалениеНажатие(Элемент)
	НастроитьРасписаниеУдаление();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РегЗаданиеУдалениеРасписаниеНажатие(Элемент, СтандартнаяОбработка)
	НастроитьРасписаниеУдаление();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура РегЗаданиеТехжурналРасписаниеНажатие(Элемент, СтандартнаяОбработка)
	НастроитьРасписаниеТехжурнал();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияРасписаниеТехжурналНажатие(Элемент)
	НастроитьРасписаниеТехжурнал();
	СтандартнаяОбработка = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ВнешниеЦККПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Элемент.ТекущиеДанные.ПередаватьДанные = Истина;
		Элемент.ТекущиеДанные.ВнешнийЦКК = "";
		Элемент.ТекущиеДанные.НеобходимаЗапись = Истина;
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ПередаватьДанные = Истина;
		Элемент.ТекущиеДанные.НеобходимаЗапись = Истина;
		Возврат;
	КонецЕсли;
	
	Элемент.ТекущиеДанные.НеобходимаЗапись = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ВнешниеЦККПередУдалением(Элемент, Отказ)
	НовСтрока = ЭтотОбъект.ВнешниеЦККУдаленные.Добавить();
	НовСтрока.ВнешнийЦКК = Элемент.ТекущиеДанные.ВнешнийЦКК;
КонецПроцедуры


&НаКлиенте
Процедура ВнешниеЦККВнешнийЦККОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ТекВнешнийЦКК = ЭтотОбъект.Элементы.ВнешниеЦКК.ТекущиеДанные.ВнешнийЦКК;
	Если ТекВнешнийЦКК <> ПредопределенноеЗначение("Справочник.ВнешниеЦКК.ПустаяСсылка") И ТекВнешнийЦКК <> ВыбранноеЗначение Тогда
		НовСтрока = ЭтотОбъект.ВнешниеЦККУдаленные.Добавить();
		НовСтрока.ВнешнийЦКК = ЭтотОбъект.Элементы.ВнешниеЦКК.ТекущиеДанные.ВнешнийЦКК;
	КонецЕсли;
КонецПроцедуры
